In [12]:
import pandas as pd
data_frame=pd.read_csv('C:/Users/user/Desktop/Pandas_1.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [14]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [15]:
type(data_frame)

pandas.core.frame.DataFrame

In [16]:
type(data_frame.name)

pandas.core.series.Series

In [17]:
list_tmp = [1,2,3]

In [19]:
list_tmp

[1, 2, 3]

In [21]:
s1=pd.core.series.Series( [1,2,3] )

In [22]:
s2=pd.core.series.Series( ['one','two','three'] )

In [26]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [29]:
!conda list | findstr pandas

pandas                    0.23.4           py37h830ac7b_0

In [30]:
import pandas as pb

In [31]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [32]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [33]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brain   45    manager
5  Chris   25     intern

In [34]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [35]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [36]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1_noheader.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [37]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1_noheader.csv', header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [38]:
df.columns = ['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
df = pd.read_csv('C:/Users/user/Desktop/Pandas_1_noheader.csv', header = None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern